# CmCaret3 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..CmCaret3 Property
SymbolTypeId Class See Also
---
Symbol cm^3, indicating unit Cubic centimeters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId CmCaret3 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CmCaret3 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CmCaret3 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace